# GetAllMassSubCategoryIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConceptualSurfaceType..::..GetAllMassSubCategoryIds Method
ConceptualSurfaceType Class See Also
---
Get all the mass subcategory ids for which there are ConceptualSurfaceType's.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static IList<ElementId> GetAllMassSubCategoryIds()
```

Visual Basic
---
```text
Public Shared Function GetAllMassSubCategoryIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
static IList<ElementId^>^ GetAllMassSubCategoryIds()
```

# ### Return Value
Returns an array of element id of mass subcategories for which there are ConceptualSurfaceType's.
# See Also
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace